month = int(input("Введите номер месяца в формате целого числа от 1 до 12: "))
year_list = [
    "Январь (Зима)",
    "Февраль (Зима)",
    "Март (Весна)",
    "Апрель (Весна)",
    "Май (Весна)",
    "Июнь (Лето)",
    "Июль (Лето)",
    "Август (Лето)",
    "Сентябрь (Осень)",
    "Октябрь (Осень)",
    "Ноябрь (Осень)",
    "Декабрь (Зима)"
]
year_dict = {
    1: "Январь (Зима)",
    2: "Февраль (Зима)",
    3: "Март (Весна)",
    4: "Апрель (Весна)",
    5: "Май (Весна)",
    6: "Июнь (Лето)",
    7: "Июль (Лето)",
    8: "Август (Лето)",
    9: "Сентябрь (Осень)",
    10: "Октябрь (Осень)",
    11: "Ноябрь (Осень)",
    12: "Декабрь (Зима)"
}
print(f"Реализация через список: {year_list[month-1]}")
print(f"Реализация через словарь: {year_dict.get(month)}")